In [ ]:
SELECT 'SQL'
AS result;

### Beginning your SQL journey

Now that you're familiar with the interface, let's get straight into it.

SQL, which stands for Structured Query Language, is a language for interacting with data stored in something called a relational database.

You can think of a relational database as a collection of tables. A table is just a set of rows and columns, like a spreadsheet, which represents exactly one type of entity. For example, a table might represent employees in a company or purchases made, but not both.

Each row, or record, of a table contains information about a single entity. For example, in a table representing employees, each row represents a single person. Each column, or field, of a table contains a single attribute for all rows in the table. For example, in a table representing employees, we might have a column containing first and last names for all employees.

### SELECTing single columns

While SQL can be used to create and modify databases, the focus of this course will be querying databases. A query is a request for data from a database table (or combination of tables). Querying is an essential skill for a data scientist, since the data you need for your analyses will often live in databases.

In SQL, you can select data from a table using a SELECT statement. For example, the following query selects the name column from the people table:

SELECT name
FROM people;

In this query, SELECT and FROM are called keywords. In SQL, keywords are not case-sensitive, which means you can write the same query as:

select name
from people;

That said, it's good practice to make SQL keywords uppercase to distinguish them from other parts of your query, like column and table names.

It's also good practice (but not necessary for the exercises in this course) to include a semicolon at the end of your query. This tells SQL where the end of your query is!

Remember, you can see the results of executing your query in the query result tab to the right!

In [ ]:
## select title from films
select title from films
# Select the release_year column from the films table.
SELECT release_year from films
# Select the name of each person in the people table.
select name from people

### SELECTing multiple columns

Well done! Now you know how to select single columns.

In the real world, you will often want to select multiple columns. Luckily, SQL makes this really easy. To select multiple columns from a table, simply separate the column names with commas!

For example, this query selects two columns, name and birthdate, from the people table:

SELECT name, birthdate
FROM people;

Sometimes, you may want to select all columns from a table. Typing out every column name would be a pain, so there's a handy shortcut:

SELECT *
FROM people;

If you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:

SELECT *
FROM people
LIMIT 10;

Before getting started with the instructions below, check out the column names in the films table by clicking on the films tab to the right!

In [ ]:
# Get the title and release year for every film.
SELECT title,release_year
FROM films;
#Get the title, release year and country for every film.
SELECT title, release_year,country
FROM films;
#Get all columns from the films table.
SELECT *
FROM films;

### SELECT DISTINCT

Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the DISTINCT keyword.

This might be useful if, for example, you're interested in knowing which languages are represented in the films table:

SELECT DISTINCT language
FROM films;

Remember, you can check out the data in the tables by clicking on the tabs to the right under the editor!

In [ ]:
# Get all the unique countries represented in the films table.
select DISTINCT country from films 
# Get all the different film certifications from the films table.
select distinct certification from films
# Get the different types of film roles from the roles table.
select distinct role from roles

### Learning to COUNT

What if you want to count the number of employees in your employees table? The COUNT statement lets you do this by returning the number of rows in one or more columns.

For example, this code gives the number of rows in the people table:

SELECT COUNT(*)
FROM people;

### Practice with COUNT

As you've seen, COUNT(*) tells you how many rows are in a table. However, if you want to count the number of non-missing values in a particular column, you can call COUNT on just that column.

For example, to count the number of birth dates present in the people table:

SELECT COUNT(birthdate)
FROM people;

It's also common to combine COUNT with DISTINCT to count the number of distinct values in a column.

For example, this query counts the number of distinct birth dates contained in the people table:

SELECT COUNT(DISTINCT birthdate)
FROM people;

Let's get some practice with COUNT!

In [ ]:
#Count the number of rows in the people table.
select count(*) from people
#Count the number of (non-missing) birth dates in the people table.
SELECT COUNT(birthdate)
FROM people;
#Count the number of unique birth dates in the people table.
SELECT  COUNT(distinct birthdate)
FROM people;
#Count the number of unique languages in the films table.
select count(distinct language) from films
#Count the number of unique countries in the films table.
select count(distinct country) from films

### Filtering results

Congrats on finishing the first chapter! You now know how to select columns and perform basic counts. This chapter will focus on filtering your results.

In SQL, the WHERE keyword allows you to filter based on both text and numeric values in a table. There are a few different comparison operators you can use:

    = equal
    <> not equal
    < less than
    > greater than
    <= less than or equal to
    >= greater than or equal to

For example, you can filter text records such as title. The following code returns all films with the title 'Metropolis':

SELECT title
FROM films
WHERE title = 'Metropolis';

Notice that the WHERE clause always comes after the FROM statement!

Note that in this course we will use <> and not != for the not equal operator, as per the SQL standard.

In [ ]:
#Get all details for all films released in 2016.
SELECT *
FROM films
WHERE release_year = 2016;
#Get the number of films released before 2000.
SELECT count(*)
FROM films
WHERE release_year < 2000;
#Get the title and release year of films released after 2000.
select title,release_year
from films
where release_year>2000

In [ ]:
#Get all details for all French language films.
select * from films where language = 'French'
#Get the name and birth date of the person born on November 11th, 1974. Remember to use ISO date format ('1974-11-11')!
select name,birthdate from people where birthdate='1974-11-11'
#Get the number of Hindi language films.
select count(*)
from films
where language='Hindi'
#Get all details for all films with an R certification.
select * from films where certification='R'

### WHERE AND

Often, you'll want to select data based on multiple conditions. You can build up your WHERE queries by combining multiple conditions with the AND keyword.

For example,

SELECT title
FROM films
WHERE release_year > 1994
AND release_year < 2000;

gives you the titles of films released between 1994 and 2000.

Note that you need to specify the column name separately for every AND condition, so the following would be invalid:

SELECT title
FROM films
WHERE release_year > 1994 AND < 2000;

In [ ]:
#Get the title and release year for all Spanish language films released before 2000.
select title,release_year from films where 
language='Spanish'
and release_year<2000
#Get all details for Spanish language films released after 2000.
select * from films where language='Spanish' and release_year>2000
#Get all details for Spanish language films released after 2000, but before 2010.
select * from films where language='Spanish' and release_year > 2000 AND release_year< 2010;

### WHERE AND OR

What if you want to select rows based on multiple conditions where some but not all of the conditions need to be met? For this, SQL has the OR operator.

For example, the following returns all films released in either 1994 or 2000:

SELECT title
FROM films
WHERE release_year = 1994
OR release_year = 2000;

Note that you need to specify the column for every OR condition, so the following is invalid:

SELECT title
FROM films
WHERE release_year = 1994 OR 2000;

When combining AND and OR, be sure to enclose the individual clauses in parentheses, like so:

SELECT title
FROM films
WHERE (release_year = 1994 OR release_year = 1995)
AND (certification = 'PG' OR certification = 'R');

In [ ]:
select title,release_year
from films
where release_year>=1990 and release_year<2000
and (language='Spanish' or language='French')
and gross>2000000

### BETWEEN

As you've learned, you can use the following query to get titles of all films released in and between 1994 and 2000:

SELECT title
FROM films
WHERE release_year >= 1994
AND release_year <= 2000;

Checking for ranges like this is very common, so in SQL the BETWEEN keyword provides a useful shorthand for filtering values within a specified range. This query is equivalent to the one above:

SELECT title
FROM films
WHERE release_year
BETWEEN 1994 AND 2000;

In [ ]:
select title,release_year
from films
where release_year between 1990 and 2000
and budget >100000000
and (language='Spanish' or language='French')

### WHERE IN

As you've seen, WHERE is very useful for filtering results. However, if you want to filter based on many conditions, WHERE can get unwieldy. For example:

SELECT name
FROM kids
WHERE age = 2
OR age = 4
OR age = 6
OR age = 8
OR age = 10;

Enter the IN operator! The IN operator allows you to specify multiple values in a WHERE clause, making it easier and quicker to specify multiple OR conditions! Neat, right?

So, the above example would become simply:

SELECT name
FROM kids
WHERE age IN (2, 4, 6, 8, 10);

In [ ]:
#Get the title and release year of all films released in 1990 or 2000 that were longer than two hours. Remember, duration is in minutes!
select title,release_year
from films
where duration>120 and
(release_year=1990 or release_year=2000)
#Get the title and language of all films which were in English, Spanish, or French.
select title,language
from films
where language in('English','Spanish','French')
#Get the title and certification of all films with an NC-17 or R certification.
select title,certification
from films
where certification in('NC-17','R')

### Introduction to NULL and IS NULL

In SQL, NULL represents a missing or unknown value. You can check for NULL values using the expression IS NULL. For example, to count the number of missing birth dates in the people table:

SELECT COUNT(*)
FROM people
WHERE birthdate IS NULL;

As you can see, IS NULL is useful when combined with WHERE to figure out what data you're missing.

Sometimes, you'll want to filter out missing values so you only get results which are not NULL. To do this, you can use the IS NOT NULL operator.

In [ ]:
#Get the names of people who are still alive, i.e. whose death date is missing.
select name
from people where deathdate is NULL
#Get the title of every film which doesn't have a budget associated with it.
select title from films where budget is null
#Get the number of films which don't have a language associated with them.
select count(*) from films where language is null

### LIKE and NOT LIKE

As you've seen, the WHERE clause can be used to filter text data. However, so far you've only been able to filter by specifying the exact text you're interested in. In the real world, often you'll want to search for a pattern rather than a specific text string.

In SQL, the LIKE operator can be used in a WHERE clause to search for a pattern in a column. To accomplish this, you use something called a wildcard as a placeholder for some other values. There are two wildcards you can use with LIKE:

The % wildcard will match zero, one, or many characters in text. For example, the following query matches companies like 'Data', 'DataC' 'DataCamp', 'DataMind', and so on:

SELECT name
FROM companies
WHERE name LIKE 'Data%';

The _ wildcard will match a single character. For example, the following query matches companies like 'DataCamp', 'DataComp', and so on:

SELECT name
FROM companies
WHERE name LIKE 'DataC_mp';

In [ ]:
#Get the names of all people whose names begin with 'B'. The pattern you need is 'B%'.
select name from people where name like 'B%'
#Get the names of people whose names have 'r' as the second letter. The pattern you need is '_r%'.
select name from people where name like '_r%'
#Get the names of people whose names don't start with A. The pattern you need is 'A%'.
select name from people where name not like 'A%'

In [ ]:
#Use the SUM function to get the total amount grossed by all films.
select sum(gross)
from films
#Get the average amount grossed by all films.
select avg(gross)
from films
#Get the amount grossed by the worst performing film.
select min(gross)
from films
#Get the amount grossed by the best performing film.
select max(gross)
from films

### Combining aggregate functions with WHERE

Aggregate functions can be combined with the WHERE clause to gain further insights from your data.

For example, to get the total budget of movies made in the year 2010 or later:

SELECT SUM(budget)
FROM films
WHERE release_year >= 2010;

In [ ]:
#Use the SUM function to get the total amount grossed by all films made in the year 2000 or later.
select sum(gross)
from films
where release_year >=2000
#Get the average amount grossed by all films whose titles start with the letter 'A'.
select avg(gross)
from films
where title like 'A%'
#Get the amount grossed by the worst performing film in 1994.
select min(gross)
from films
where release_year=1994
#Get the amount grossed by the best performing film between 2000 and 2012, inclusive.
select max(gross)
from films
where release_year between 2000 and 2012

### It's AS simple AS aliasing

You may have noticed in the first exercise of this chapter that the column name of your result was just the name of the function you used. For example,

SELECT MAX(budget)
FROM films;

gives you a result with one column, named max. But what if you use two functions like this?

SELECT MAX(budget), MAX(duration)
FROM films;

Well, then you'd have two columns named max, which isn't very useful!

To avoid situations like this, SQL allows you to do something called aliasing. Aliasing simply means you assign a temporary name to something. To alias, you use the AS keyword, which you've already seen earlier in this course.

For example, in the above example we could use aliases to make the result clearer:

SELECT MAX(budget) AS max_budget,
       MAX(duration) AS max_duration
FROM films;

In [ ]:
#Get the title and net profit (the amount a film grossed, minus its budget) for all films. Alias the net profit as net_profit.
select title,gross - budget as net_profit from films
#Get the title and duration in hours for all films. The duration is in minutes, so you'll need to divide by 60.0 to get the duration in hours. Alias the duration in hours as duration_hours.
select title,duration/60.0 as duration_hours from films
#Get the average duration in hours for all films, aliased as avg_duration_hours.
select AVG(duration) / 60.0 AS avg_duration_hours 
from films

In [ ]:
#Get the percentage of people who are no longer alive. Alias the result as percentage_dead. Remember to use 100.0 and not 100!
-- get the count(deathdate) and multiply by 100.0
select count(deathdate)* 100.0 /count(*) as percentage_dead from people
-- then divide by count(*)
#Get the number of years between the newest film and oldest film. Alias the result as difference.
select max(release_year)-min(release_year) as difference from films
#Get the number of decades the films table covers. Alias the result as number_of_decades. The top half of your fraction should be enclosed in parentheses.
select (max(release_year)-min(release_year)) / 10.0 as number_of_decades from films

### ORDER BY

Congratulations on making it this far! You now know how to select and filter your results.

In this chapter you'll learn how to sort and group your results to gain further insight. Let's go!

In SQL, the ORDER BY keyword is used to sort results in ascending or descending order according to the values of one or more columns.

By default ORDER BY will sort in ascending order. If you want to sort the results in descending order, you can use the DESC keyword. For example,

SELECT title
FROM films
ORDER BY release_year DESC;

gives you the titles of films sorted by release year, from newest to oldest.

In [ ]:
#Get the names of people from the people table, sorted alphabetically.
select name  from people order by name
#Get the names of people, sorted by birth date.
select name from people order by birthdate
#Get the birth date and name for every person, in order of when they were born.
select birthdate,name from people order by birthdate

In [ ]:
#Get the title of films released in 2000 or 2012, in the order they were released.
select title from films where release_year in (2000,2012) order by release_year
#Get all details for all films except those released in 2015 and order them by duration.
select* from films where release_year<>2015 order by duration
#Get the title and gross earnings for movies which begin with the letter 'M' and order the results alphabetically.
select title,gross from films where title like 'M%' order by title

In [ ]:
#Get the IMDB score and film ID for every film from the reviews table, sorted from highest to lowest score.
select imdb_score,film_id from reviews order by imdb_score DESC
#Get the title for every film, in reverse order.
select title from films order by title desc
#Get the title and duration for every film, in order of longest duration to shortest.
select title,duration from films order by duration desc

### Sorting multiple columns

ORDER BY can also be used to sort on multiple columns. It will sort by the first column specified, then sort by the next, then the next, and so on. For example,

SELECT birthdate, name
FROM people
ORDER BY birthdate, name;

sorts on birth dates first (oldest to newest) and then sorts on the names in alphabetical order. The order of columns is important!

Try using ORDER BY to sort multiple columns! Remember, to specify multiple columns you separate the column names with a comma.

In [ ]:
#Get the birth date and name of people in the people table, in order of when they were born and alphabetically by name.
select birthdate,name from people order by birthdate,name
#Get the release year, duration, and title of films ordered by their release year and duration.
select release_year,duration,title from films order by release_year,duration
#Get certifications, release years, and titles of films ordered by certification (alphabetically) and release year.
select certification,release_year,title from films order by certification,release_year
#Get the names and birthdates of people ordered by name and birth date.
select name,birthdate from people order by name,birthdate

### GROUP BY

Now you know how to sort results! Often you'll need to aggregate results. For example, you might want to count the number of male and female employees in your company. Here, what you want is to group all the males together and count them, and group all the females together and count them. In SQL, GROUP BY allows you to group a result by one or more columns, like so:

SELECT sex, count(*)
FROM employees
GROUP BY sex;
#### GROUP BY practice

As you've just seen, combining aggregate functions with GROUP BY can yield some powerful results!

A word of warning: SQL will return an error if you try to SELECT a field that is not in your GROUP BY clause without using it to calculate some kind of value about the entire group.

Note that you can combine GROUP BY with ORDER BY to group your results, calculate something about them, and then order your results. For example,

SELECT sex, count(*)
FROM employees
GROUP BY sex
ORDER BY count DESC;

In [ ]:
#Get the release year and count of films released in each year.
select release_year,count(*)
from films 
group by release_year
#Get the release year and average duration of all films, grouped by release year.
select release_year,avg(duration) from films group by release_year
#Get the release year and largest budget for all films, grouped by release year.
select release_year,max(budget)
from films group by release_year
#Get the IMDB score and count of film reviews grouped by IMDB score in the reviews table.
select imdb_score,count(*)
from reviews group by imdb_score
#Get the release year and lowest gross earnings per release year.
select release_year,min(gross)
from films
group by release_year
#Get the language and total gross amount films in each language made.
select language,sum(gross)
from films
group by language
#Get the country and total budget spent making movies in each country.
select country,sum(budget)
from films
group by country
#Get the release year, country, and highest budget spent making a film for each year, for each country. Sort your results by release year and country.
select release_year,country,max(budget)
from films
group by release_year,country
order by release_year,country
#Get the country, release year, and lowest amount grossed per release year per country. Order your results by country and release year.
select country,release_year,min(gross)
from films
group by release_year,country
order by country,release_year

### HAVING a great time

In SQL, aggregate functions can't be used in WHERE clauses. For example, the following query is invalid:

SELECT release_year
FROM films
GROUP BY release_year
WHERE COUNT(title) > 10;

This means that if you want to filter based on the result of an aggregate function, you need another way! That's where the HAVING clause comes in. For example,

SELECT release_year
FROM films
GROUP BY release_year
HAVING COUNT(title) > 10;

In [ ]:
SELECT release_year, AVG(budget) AS avg_budget, AVG(gross) AS avg_gross
FROM films
WHERE release_year > 1990
GROUP BY release_year
HAVING AVG(budget) > 60000000
ORDER BY avg_gross DESC;

In [ ]:
-- select country, average budget, average gross
select country,avg(budget) as avg_budget,avg(gross) as avg_gross
-- from the films table
from films
-- group by country 
group by country
-- where the country has more than 10 titles
having count(title)>10
-- order by country
order by country
-- limit to only show 5 results
limit 5

In [ ]:
SELECT title, imdb_score
FROM films
JOIN reviews
ON films.id = reviews.film_id
WHERE title = 'To Kill a Mockingbird';